# Password Manager
cask "1password"

### Coding utilities

# Code and text editor
cask "visual-studio-code"
cask "zed"
cask "intellij-idea-ce"
cask "coteditor"
brew "nano"

# Terminal
cask "iterm2"
brew "fish"

# Source control
brew "git"
brew "yadm"

# Javascript
brew "node"
brew "pnpm"
brew "yarn"
tap "oven-sh/bun"
brew "bun"

# Other
brew "go-task"
brew "python3"
brew "azure-cli"
brew "ruby"
brew "pkl"

# Docker
brew "docker"
brew "docker-compose"

# Best language
brew "openjdk"
brew "maven"

# C-sharp
cask "dotnet-sdk"

# C/C++
brew "gcc"
brew "sdl12-compat"

## SQL
cask "dbeaver-community"

# Postgres
cask "postico"
cask "pgadmin4"

# MySQL
cask "mysqlworkbench"

# HTTP
cask "postman"
cask "soapui"

### General applications

# Socials
cask "discord"
cask "slack"

# Browsers
cask "firefox"
cask "google-chrome"

# Cloud storage
cask "google-drive"

# Video
cask "obs"
cask "vlc"
brew "ffmpeg"

# Pictures
cask "gimp"
cask "phoenix-slides"
cask "qview"

# Audio
cask "foobar2000"

# Email
cask "microsoft-outlook"

# Math
cask "geogebra"

### OS utilities

# Search
cask "raycast"

# Window manager
cask "rectangle"

# Menu bar
cask "hiddenbar"

### Hardware utilities

# Input editing
cask "karabiner-elements"
cask "linearmouse"
cask "logi-options-plus"

# System
cask "hot"
cask "battery"
cask "stats"
cask "cinebench"
