# Password Manager
cask "1password"
cask "1password-cli"

### Coding utilities

# Code and text editor
cask "visual-studio-code"
cask "intellij-idea-ce"
cask "coteditor"
brew "nano"
brew "neovim"

# CLI
brew "tree"
brew "k9s"

# Terminal
cask "iterm2"
brew "fish"

# Source control
brew "git"
brew "yadm"
brew "lazygit"

# Javascript
brew "node"
brew "pnpm"
brew "yarn"
tap "oven-sh/bun"
brew "bun"
brew "deno"

# Programming languages
brew "python3"
brew "ruby"
brew "lua"

# Programming tools
brew "go-task"
brew "azure-cli"
brew "pkl"
brew "golangci-lint"
brew "luarocks"

# Containerization
cask "docker"
brew "docker-compose"
brew "podman"
brew "podman-compose"

# Best language
brew "openjdk"
brew "maven"

# C-sharp
cask "dotnet-sdk"

# C/C++
brew "gcc"
brew "sdl12-compat"

## SQL
cask "dbeaver-community"
brew "redis"

# Postgres
cask "postico"
cask "pgadmin4"

# MySQL
cask "mysqlworkbench"

# HTTP
cask "postman"

### General applications

# Socials
cask "discord"
cask "slack"

# Browsers
cask "firefox"
cask "google-chrome"

# Cloud storage
cask "google-drive"

# Video
cask "obs"
cask "vlc"
brew "ffmpeg"

# Pictures
cask "gimp"
cask "phoenix-slides"
cask "qview"

# Audio
cask "foobar2000"

# Email
cask "microsoft-outlook"

# Math
cask "geogebra"

### OS utilities

# Search
cask "raycast"

# Window manager
cask "rectangle"

# Menu bar
cask "hiddenbar"

### Hardware utilities

# Input editing
cask "karabiner-elements"              # Keyboard binds
cask "linearmouse"                     # Per mouse settings
cask "logi-options-plus"               # Logi mouse driver

# System
cask "hot"
cask "battery"
cask "stats"
cask "cinebench"
cask "background-music"                # Per app volume
