# Password Manager
cask "1password"

### Coding utilities

# Code and text editor
cask "visual-studio-code"
cask "zed"

# Source control
brew "git"
brew "yadm"

# Javascript
brew "node"
brew "pnpm"
brew "corepack"
tap "oven-sh/bun"
brew "bun"

# Other
brew "go"
brew "go-task"
brew "python3"

# Docker
brew "docker"
brew "docker-compose"

# Best language
brew "openjdk"

## SQL
cask "dbeaver-community"

# Postgres
cask "postico"
cask "pgadmin4"

# MySQL
cask "mysqlworkbench"

# HTTP
cask "postman"

### General applications

# Socials
cask "discord"
cask "slack"

# Browsers
cask "firefox"
cask "google-chrome"

# Cloud storage
cask "google-drive"

# Video
cask "obs"
cask "vlc"
brew "ffmpeg"

# Pictures
cask "gimp"

# Audio
cask "foobar2000"

# Email
cask "microsoft-outlook"

### Hardware utilities

# Input editing
cask "karabiner-elements"
cask "linearmouse"
cask "logi-options-plus"

# System
cask "hot"
cask "battery"